app/controllers/cat_rental_requests_controller.rb

SELECT "cat_rental_requests".* FROM "cat_rental_requests"
---
    def index
        @cat_rental_requests = CatRentalRequest.all

SELECT "cats".* FROM "cats"
---
    def new
        @cats = Cat.all

INSERT INTO "cat_rental_requests" ("cat_id", "start_date", "end_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["cat_id", 2], ["start_date", "2021-02-26"], ["end_date", "2021-02-28"], ["created_at", "2021-02-25 20:05:51.979626"], ["updated_at", "2021-02-25 20:05:51.979626"]]
---
    def create
        p rental_request_params
        @cat_rental_request = CatRentalRequest.new(rental_request_params)

        if @cat_rental_request.save