app/controllers/cats_controller.rb

INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        p cat_params
        @cat = Cat.new(cat_params)


        if @cat.save

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "cats" SET "color" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["color", "Black"], ["updated_at", "2021-02-03 18:27:31.821479"], ["id", 5]]
---
    def update
        p cat_params
        @cat = Cat.find_by(id: params[:id])

        if @cat.update (cat_params)